const Icons_get = {
  200: { day: "⛈️", night: "⛈️" },
  201: { day: "⛈️", night: "⛈️" },
  202: { day: "⛈️", night: "⛈️" },
  210: { day: "🌩️", night: "🌩️" },
  211: { day: "🌩️", night: "🌩️" },
  212: { day: "🌩️", night: "🌩️" },
  221: { day: "🌩️", night: "🌩️" },
  230: { day: "⛈️", night: "⛈️" },
  231: { day: "⛈️", night: "⛈️" },
  232: { day: "⛈️", night: "⛈️" },

  300: { day: "🌦️", night: "🌦️" },
  301: { day: "🌦️", night: "🌦️" },
  302: { day: "🌧️", night: "🌧️" },
  310: { day: "🌦️", night: "🌦️" },
  311: { day: "🌧️", night: "🌧️" },
  312: { day: "🌧️", night: "🌧️" },
  313: { day: "🌧️", night: "🌧️" },
  314: { day: "🌧️", night: "🌧️" },
  321: { day: "🌦️", night: "🌦️" },

  500: { day: "🌦️", night: "🌦️" },
  501: { day: "🌧️", night: "🌧️" },
  502: { day: "🌧️", night: "🌧️" },
  503: { day: "🌧️", night: "🌧️" },
  504: { day: "🌧️", night: "🌧️" },
  511: { day: "❄️🌧️", night: "❄️🌧️" },
  520: { day: "🌦️", night: "🌦️" },
  521: { day: "🌧️", night: "🌧️" },
  522: { day: "🌧️", night: "🌧️" },
  531: { day: "🌧️", night: "🌧️" },

  600: { day: "🌨️", night: "🌨️" },
  601: { day: "❄️", night: "❄️" },
  602: { day: "❄️❄️", night: "❄️❄️" },
  611: { day: "🌨️", night: "🌨️" },
  612: { day: "🌨️", night: "🌨️" },
  613: { day: "🌨️", night: "🌨️" },
  615: { day: "🌨️🌧️", night: "🌨️🌧️" },
  616: { day: "🌨️🌧️", night: "🌨️🌧️" },
  620: { day: "🌨️", night: "🌨️" },
  621: { day: "🌨️", night: "🌨️" },
  622: { day: "❄️❄️", night: "❄️❄️" },

  701: { day: "🌫️", night: "🌫️" },
  711: { day: "🌫️", night: "🌫️" },
  721: { day: "🌫️", night: "🌫️" },
  731: { day: "🌪️", night: "🌪️" },
  741: { day: "🌫️", night: "🌫️" },
  751: { day: "🏜️", night: "🏜️" },
  761: { day: "🌫️", night: "🌫️" },
  762: { day: "🌋", night: "🌋" },
  771: { day: "💨", night: "💨" },
  781: { day: "🌪️", night: "🌪️" },

  800: { day: "☀️", night: "🌙" },

  801: { day: "🌤️", night: "🌤️" },
  802: { day: "⛅", night: "⛅" },
  803: { day: "☁️", night: "☁️" },
  804: { day: "☁️☁️", night: "☁️☁️" }
}

export const getWeatherEmoji = (conditionCode, isDay = true) => {
    const icons = Icons_get[conditionCode]
    if (icons) {
        return isDay ? icons.day : icons.night
    }
    return isDay ? "💀" : "💀"
}
